def controlNum(strUIN):

    letNum = {"0": 0,
              "1": 1,
              "2": 2,
              "3": 3,
              "4": 4,
              "5": 5,
              "6": 6,
              "7": 7,
              "8": 8,
              "9": 9,
              "А": 1,
              "Б": 2,
              "В": 3,
              "Г": 4,
              "Д": 5,
              "Е": 6,
              "Ё": 6,
              "Ж": 7,
              "З": 8,
              "И": 9,
              "Й": 9,
              "К": 0,
              "Л": 1,
              "М": 2,
              "Н": 3,
              "О": 4,
              "П": 5,
              "Р": 6,
              "С": 7,
              "Т": 8,
              "У": 9,
              "Ф": 0,
              "Х": 1,
              "Ц": 2,
              "Ч": 3,
              "Ш": 4,
              "Щ": 5,
              "Э": 6,
              "Ю": 7,
              "Я": 8,
              "Ъ": 3,
              "Ы": 6,
              "Ь": 2,
              "A": 1,
              "B": 3,
              "C": 7,
              "D": 9,
              "E": 6,
              "F": 0,
              "G": 1,
              "H": 3,
              "I": 2,
              "J": 3,
              "K": 0,
              "L": 4,
              "M": 2,
              "N": 5,
              "O": 4,
              "P": 6,
              "Q": 6,
              "R": 7,
              "S": 8,
              "T": 8,
              "U": 9,
              "V": 0,
              "W": 1,
              "X": 1,
              "Y": 9,
              "Z": 2
             }
    
    row = (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 1, 2, 3)
    row2 = (3, 4, 5, 6, 7, 8, 9, 10, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 1, 2, 3, 4, 5, 6)
    
    multList = []
    
    i = 0
    for num in strUIN:
        multList.append(letNum[num] * row[i])
        i += 1

    sum = 0
    for num in multList:
        sum += num

    cNum = sum % 11
    
    if cNum == 10:
        multList = []
    
        i = 0
        for num in strUIN:
            multList.append(int(num) * row2[i])
            i += 1

        sum = 0
        for num in multList:
            sum += num

        cNum = sum % 11

        if cNum == 10:
            cNum = 0
        
    
    return cNum


while True:
    uin = input("УИН: ")

    f = True
    
    if len(uin) == 1:
        if uin != "0":
            print("Некорректный УИН: если длина 1 символ, то значение может быть только 0")
            f = False


            
    if len(uin) == 20:    
        if uin == "00000000000000000000":
            print("Некорректный УИН: все знаки одновременно не могут принимать значение 0")
            f = False

        if uin[3:19] == "0000000000000000":
            print("Некорректный УИН: 16 цифр, указанных в разрядах с 4 по 19, не могут все одновременно быть = 0")
            f = False

        cNum = controlNum(uin[:19])    
        if int(uin[-1]) != cNum:
            print("Некорректный УИН: неверный контрольный разряд (20-ый разряд)")
            print("Контрольный разряд должен быть", cNum)
            f = False

            
    if len(uin) == 25:
        if uin == "0000000000000000000000000":
            print("Некорректный УИН: все знаки одновременно не могут принимать значение 0")
            f = False

        if uin[8:24] == "0000000000000000":
            print("Некорректный УИН: 16 цифр, указанных в разрядах с 9 по 24, не могут все одновременно быть = 0")
            f = False

        cNum = controlNum(uin[:24])          
        if int(uin[-1]) != cNum:
            print("Некорректный УИН: неверный контрольный разряд (25-ый разряд)")
            print("Контрольный разряд должен быть", cNum)
            f = False

    if len(uin) not in (1, 20, 25):
        print("Некорректный УИН: длина должна быть 1, 20 или 25 знаков")
        f = False

    if f == True:
        print("Корректный УИН")
        
    print()
        
    
    
